# Copyright (c) 2024, NVIDIA CORPORATION.  All rights reserved.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

name: "speech_encoder"
backend: "python"
max_batch_size: ${triton_max_batch_size}

dynamic_batching {
    preferred_batch_size: [ ${triton_max_batch_size} ]
    max_queue_delay_microseconds: ${max_queue_delay_microseconds}
}

parameters [
  {
   key: "adapter_dir", 
   value: { string_value: "${adapter_dir}"}
  },
  {
    key: "engine_dir"
    value: { string_value: "${encoder_engine_dir}"}
  },
  {
   key: "n_mels", 
   value: {string_value:"${n_mels}"} # 128 dim for large-v3, 80 dim for large-v2
  }
]

input [
  {
    name: "mel"
    data_type: TYPE_FP16
    dims: [ -1, -1 ]
    optional: True
  },
  {
    name: "WAV"
    data_type: TYPE_FP32
    dims: [-1]
    optional: True
  },
  {
    name: "WAV_LENS"
    data_type: TYPE_INT32
    dims: [1]
    optional: True
  }
]
output [
  {
    name: "speech_features"
    data_type: TYPE_FP16
    dims: [ -1, -1]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]